//=============================================================================
//
// 60FPSのMain処理 [60FPSmain.cpp]
// Author : 蔡 友剛
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

#define _USE_MATH_DEFINES
#define _CRT_SECURE_NO_WARNINGS

#include <Windows.h>
#include <winnt.h>
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <time.h>
#include <timeapi.h>
#include <mmsystem.h>
#pragma comment (lib, "winmm.lib")

//=============================================================================
// マクロ定義
//=============================================================================
#define CLASS_NAME			  ("AppClass")		    // ウインドウのクラス名
#define WINDOW_NAME			  ("Hello World")	     // ウインドウのキャプション名

#define SCREEN_WIDTH		  (1280)				      // ウインドウの幅
#define SCREEN_HEIGHT		  (720)				        // ウインドウの高さ
#define SCREEN_CENTER_X		(SCREEN_WIDTH / 2)	// ウインドウの中心Ｘ座標
#define SCREEN_CENTER_Y		(SCREEN_HEIGHT / 2)	// ウインドウの中心Ｙ座標

#define DEFAULT_FPS			  (60)				        // フレーム/秒

//=============================================================================
// 構造体宣言
//=============================================================================

//*****************************************************************************
// 定数定義(enum定義)
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************




#endif
